In [10]:
import pandas as pd
import json

In [11]:
# open json
with open("sample4.json") as f:
    data = json.load(f)

In [12]:
data

[{'firstName': 'Joe',
  'lastName': 'Jackson',
  'gender': 'male',
  'age': 28,
  'number': '7349282382'},
 {'firstName': 'James',
  'lastName': 'Smith',
  'gender': 'male',
  'age': 32,
  'number': '5678568567'},
 {'firstName': 'Emily',
  'lastName': 'Jones',
  'gender': 'female',
  'age': 24,
  'number': '456754675'}]

In [13]:
df = pd.DataFrame(data)

In [14]:
df.head()

  firstName lastName  gender  age      number
0       Joe  Jackson    male   28  7349282382
1     James    Smith    male   32  5678568567
2     Emily    Jones  female   24   456754675

In [15]:
df.columns

Index(['firstName', 'lastName', 'gender', 'age', 'number'], dtype='object')

In [16]:
#sql connection
import sqlite3
conn = sqlite3.connect("test.db")
c= conn.cursor()

In [17]:
# df.to_sql("jsntable",conn)

In [18]:
from tabulate import tabulate
c.execute("""
select firstName,lastName,gender,age,number from jsntable;

""")

# print(c.fetchall())
# print(type(c.fetchall()))
# li=[]
# li=c.fetchall()
# print(type(li))
# # print(li)

# # print(len(li))

# for i,j in enumerate(li):
#     li[i]=list(li[i])

# print(li)

output =  c.fetchall()

print(output)

for item in output:
    print(item)

print(len(output))
li=[]
# i=0
for i,j in enumerate(output):
    # li[i]=list(output[i])
    li.append(list(j))

print(len(li))
print(li)
print(tabulate(li, headers=["firstName", "lastName", "gender","age","number","index1"],tablefmt='orgtbl'))
# print(tabulate([['Alice', 24], ['Bob', 19]], headers=['Name', 'Age']))
# conn.commit()
# conn.close()

[('Joe', 'Jackson', 'male', 28, '7349282382'), ('James', 'Smith', 'male', 32, '5678568567'), ('Emily', 'Jones', 'female', 24, '456754675')]
('Joe', 'Jackson', 'male', 28, '7349282382')
('James', 'Smith', 'male', 32, '5678568567')
('Emily', 'Jones', 'female', 24, '456754675')
3
3
[['Joe', 'Jackson', 'male', 28, '7349282382'], ['James', 'Smith', 'male', 32, '5678568567'], ['Emily', 'Jones', 'female', 24, '456754675']]
| firstName   | lastName   | gender   |   age |     number |
|-------------+------------+----------+-------+------------|
| Joe         | Jackson    | male     |    28 | 7349282382 |
| James       | Smith      | male     |    32 | 5678568567 |
| Emily       | Jones      | female   |    24 |  456754675 |